### 与运算

1. 两位同时为1，结果才为1，否则为0
	* 3&5 =
	* 0000 0011 &
	* 0000 0101 = 
	* 0000 0001	
2. 用途
	* 清零：将某些二进制位与0相与清零
	* 取一个数的指定位：与上一个其他位为0的数
		* 1010 1110 &
		* 0000 1111 = 
		* 0000 1110

### 或运算

1. 两位只要有一位为1，结果就为1
	* 3|5 = 
	* 0000 0011 |
	* 0000 0101 = 
	* 0000 0111
2. 用途
	* 将一个数指定位置为1
		* 1010 0000 |
		* 0000 1111 =
		* 1010 1111

### 异或运算

1. 两位不同，结果才为1，否则为0
	* 3^5 = 
	* 0000 0011 ^
	* 0000 0101 = 
	* 0000 0110
2. 用途
	* 将一个数特定位翻转
		* 1010 1110 ^
		* 0000 1111 = 
		* 1010 0001

### 取反运算

1. 将一个数按二进制位取反
	* ～3 = 
	* ～0000 0011
	* =1111 1100
2. 用途
	* 将一个数最低位置为0 
		* 3&～1 =
		* 0000 0011 &
		* 1111 1110 = 
		* 0000 0010

### 左移运算

1. 将一个数的二进制位全部左移若干位（最左边丢弃，最右边补0）
	* 3<<1 = 
	* 0000 0011<<1 =
	* 0000 0110 =
	* 3 * 2
2. 若左移时舍弃的高位不包含1，则每左移一位，相当于该数乘以2

### 右移运算

1. 将一个数的各二进制位全部右移若干位（正数左补0，负数左补1，右边丢弃）
	* 3>>1 = 
	* 0000 0011>>1 = 
	* 0000 0001 = 
	* 3/2
2. 每又移一位，相当于该数除以2

### 负数二进制表示为其正值的补码（反码加1）

### 参考
1. [link1](http://www.cnblogs.com/blueskycc/p/5463309.html)
