### 2016工作总结
1. 负责爱耳目iOS App（主版本）架构搭建及核心功能研发和维护 
2. 负责爱耳目iOS App（企业版）开发和维护 
3. 负责iOS SDK的开发 
4. 负责技术选型和难点攻关、技术预研
5. 负责小组内成员任务分配和协调、进度跟进
6. 负责与产品、后台、固件、羚羊云的沟通和协调 
7. 负责爱耳目客户定制App的开发
8. 第三方接入厂商的对接和技术支持工作 
9. 兄弟公司招聘技术面试工作

### 2016工作成果
1. 主版本V10.0.0~V10.10.21， 15个版本
2. 企业版V10.0.0~V10.5.18，10个版本
3. 英文版V1.0～V1.5.6，7个版本
4. iOSSDKV1.0~V1.1，2个版本 
5. 乐网、智慧树

### 反思
1. 重复性工作做到自动化，半自动化
2. 持续进行组件化工作
3. 多花一些时间corereview,相互review

### 下阶段目标、调整方向
1. iOS 产品线的持续迭代开发
2. 新App的技术调研
3. 

### 难点、解决方案
1. 降低崩溃率
	1. 开发过程中代码要规范，在容易产生崩溃的地方做保护，如多线程访问数据
	2. 加入崩溃日志抓取工具，获取到崩溃的场景和堆栈信息，便于浮现问题和修复bug
2. App安装包瘦身
	1. 资源瘦身，去掉无用的资源和压缩资源。包括图片、音视频文件、配置文件等
	2. 可执行文件瘦身，查找无用的selector，查找无用的类、去除重复的代码等

### 公司建议
1. 网络
